{"id": "ex20953", "tokens": "On 16 December 2022, Second Kishida Reshuffled Cabinet approved a trio of defense-related policy documents, including its new National Security Strategy (NSS or 国家安全保障戦略), the strategic guideline document for the Japanese government's policies regarding diplomacy, defense, and economic security for the next decade. Based on the NSS, the National Defense Strategy (国家防衛戦略) outlined Japan's defense policy goals and the means to achieve them while the Defense Buildup Program (防衛力整備計画) outlined the scale of the introduction of specific defense equipment within the budgetary objectives. According to the Defense Buildup Program, the Japan Maritime Self-Defense Force (JMSDF) will increase the number of Aegis-equipped guided-missile destroyers (DDG) from the current eight to ten, as well as two Aegis system-equipped vessels (ASEV) to be deployed in ballistic missile defense (BMD) operations. By the end of the decade, the JMSDF will operate 12 ships equipped with Aegis Weapon System (AWS) and likewise plans to replace its fleet of older, less capable destroyers and destroyer escorts with Mogami-class frigates.", "split": {"s": 1024, "o": 128}}
{"id": "ex3649", "tokens": "During the month of June 1937 the government of the Popular Front, now clearly under Communist sway, eradicates those segments of its own army under the control of the POUM and of the Anarchists, every one stationed in the Front of Aragon. On 29 July the 29th Division of the POUM is disarmed in the Front of Huesca and on August 4 the Anarchist–Sindicalista Council of Aragon is dissolved by decree. In Barcelona the police unleashes the cruellest of persecutions against the POUM. The new police chief since May is Ricardo Burillo Stholle, a professional officer and a Mason, who was the commander of the Assault Guards that killed José Calvo Sotelo and who has now joined the PCE. On cue from Alexander Orlov—liaison of the NKVD (Soviet secret police) with the Ministry of the Interior of the Second Spanish Republic and responsible on the Soviet side for the transfer of the gold of Moscow from Spain to the Soviet Union—Burillo's officers arrest Andrés Nin leader of the POUM. Taken first to Valencia and then to Madrid, Nin will be tortured, skinned, mutilated and finally murdered by Orlov's agents at Alcalá de Henares on June 20, 1937.", "split": {"s": 1024, "o": 128}}
{"id": "ex820", "tokens": "In the women's draw, following Monfils' withdrawal earlier on, Victoria Azarenka and Serena Williams took the court earlier than expected, and it was the young Belarusian who made the better start, breaking the three-time champion twice to take the first set 6–3. However, after a missing chances to go 2–0 up in the second, Azarenka started to show signs of discomfort and was broken instead to trail 3–2, and a medical timeout couldn't do the wonders as the youngster retired in tears after another game. Azarenka later explained that she had been throwing up all morning and was feeling weak, but thought she could play after feeling better before her game, but ultimately succumbed. Williams went through to the quarterfinals, where she will play 8th seeded Svetlana Kuznetsova, who benefited from yet another withdrawal, in the form of 22nd seed Zheng Jie, who retired after five games with a wrist injury she picked up in the third game after falling and landing awkwardly on her hand. Elena Dementieva advanced with her fourteenth win of the season, this time dominating Slovakia's 18th seed Dominika Cibulková, 6–2, 6–2, and will play another giantkiller, unseeded Carla Suárez Navarro in the quarterfinals, the latter easily dispatching compatriot and 21st seed Anabel Medina Garrigues 6–3, 6–2 earlier in the day.", "split": {"s": 1024, "o": 128}}
{"id": "ex9013", "tokens": "Several hypotheses have been proposed about the biogeography of the spinosaurids. Since Suchomimus was more closely related to Baryonyx (from Europe) than to Spinosaurus—although that genus also lived in Africa—the distribution of spinosaurids cannot be explained as vicariance resulting from continental rifting. Sereno and colleagues proposed that spinosaurids were initially distributed across the supercontinent Pangea, but split with the opening of the Tethys Sea. Spinosaurines would then have evolved in the south (Africa and South America: in Gondwana) and baryonychines in the north (Europe: in Laurasia), with Suchomimus the result of a single north-to-south dispersal event. Buffetaut and the Tunisian palaeontologist Mohamed Ouaja also suggested in 2002 that baryonychines could be the ancestors of spinosaurines, which appear to have replaced the former in Africa. Milner suggested in 2003 that spinosaurids originated in Laurasia during the Jurassic, and dispersed via the Iberian land bridge into Gondwana, where they radiated. In 2007, Buffetaut pointed out that palaeogeographical studies had demonstrated that Iberia was near northern Africa during the Early Cretaceous, which he found to confirm Milner's idea that the Iberian region was a stepping stone between Europe and Africa, which is supported by the presence of baryonychines in Iberia. The direction of the dispersal between Europe and Africa is still unknown, and subsequent discoveries of spinosaurid remains in Asia and possibly Australia indicate that it may have been complex. The findings of Barker et al. are consistent with Milner's findings, where Spinosauridae arose in Europe and there were at least two migrations to Africa.", "split": {"s": 1024, "o": 128}}
{"id": "ex8025", "tokens": "People from the countries mentioned in the order with valid visas were turned away from flights to the U.S. Some were stranded in a foreign country while in transit. Several people already on planes flying to the U.S. at the time the order was signed were detained on arrival. On January 28 the American Civil Liberties Union (ACLU) estimated that there were 100 to 200 people being detained in U.S. airports, and hundreds were barred from boarding U.S.-bound flights. About 60 legal permanent residents were reported as detained at Dulles International Airport near Washington, D.C. Travelers were also detained at O'Hare International Airport without access to their cellphones and unable to access legal assistance. The Council on American-Islamic Relations (CAIR) offers free legal help to travelers who experience problems with the \"ban\". Attorneys are stationed, around the clock, at the Chicago airport and CAIR also encourages travelers to register with them, prior to travel. The Department of Homeland Security (DHS) said on January 28 that the order was applied to \"less than one percent\" of the 325,000 air travelers who arrived in the United States. By January 29 DHS estimated that 375 travelers had been affected with 109 travelers in transit and another 173 prevented from boarding flights. In some airports there were reports that Border Patrol agents were requesting access to travelers' social media accounts.", "split": {"s": 1024, "o": 128}}
{"id": "ex7315", "tokens": "Having graduated from the four-year school with honors in 1977, he began his service in Poland as a tank platoon commander in the 80th Tank Regiment of the 90th Guards Tank Division of the Northern Group of Forces. Gerasimov rose to tank company commander and tank battalion chief of staff before being transferred to the 5th Combined Arms Army of the Far Eastern Military District in 1982. He served there as chief of staff of a tank battalion of the 185th Tank Regiment of the 29th Motor Rifle Division, and was promoted to command the tank battalion of the 231st Motor Rifle Regiment of the 40th Motor Rifle Division. Gerasimov was admitted to the Malinovsky Military Armored Forces Academy in 1984 for advanced officer training. Graduating with honors in 1987, he was posted to the Baltic Military District, serving as chief of staff of and then commanding the 228th Tank Regiment of the 144th Guards Motor Rifle Division. After being promoted to chief of staff of the division, Gerasimov took command of the 144th Guards, supervising its withdrawal to Russia.", "split": {"s": 1024, "o": 128}}
{"id": "ex4573", "tokens": "However, the American Ornithologists' Union (AOU) castigated the authors for not using the AOU's guidelines and policies, particularly in the treatment of hyphens. The AOU argued that \"hyphens in compound group names indicate relationships and separate the members of the groups from less closely related forms,\" stating as examples that the hyphen in \"Whistling-Ducks\" distinguishes those birds from other ducks and the hyphen in \"Storm-Petrels\" separates them from other petrels in the family Procellariidae. The authors felt the need to respond. They pointed out that hyphens are not used in this fashion in fields such as herpetology and suggested that \"well-intentioned hyphenation practices misrepresent phylogenetic relationships too often to be helpful.\" They repeated their recommendation that hyphens should be used \"sparingly,\" and urged their fellow ornithologists to \"work together to simplify the use of hyphens as one small step towards improved standardization of English bird names.\" Other commenters weighed in as well. Capitalization presented another dispute, and still has not reached a uniform resolution.", "split": {"s": 1024, "o": 128}}
{"id": "ex3359", "tokens": "First deployed to Vietnam in 1964, DePuy served as Chief of Staff of Operations for Military Assistance Command, Vietnam, and in March 1966 he assumed command of the 1st Infantry Division (\"the Big Red One\"). During his time as commander, he established a scholarship fund for the children of 1st Infantry Division soldiers killed in Vietnam, which eventually became the 1st Infantry Division Foundation. Also during his time as commander, he became known as having an \"ax-swinging\" style of officer management; having fired as many as 56 officers under him, including seven battalion commanders and many more majors, captains and sergeants major. This led Army chief of staff General Harold K. Johnson to say, \"If every division commander relieved people like DePuy, I'd soon be out of lieutenant colonels and majors. He just eats them up like peanuts.\" DePuy later explained to an interviewer that his experience in World War II had informed him of the importance of good leadership in war as he had \"fought in Normandy with three battalion commanders who should have been relieved in peacetime.\" He firmly believed that command was a privilege to be earned, not a right.", "split": {"s": 1024, "o": 128}}
{"id": "ex17871", "tokens": "Logan Turner from HM Magazine, gave the album three and a half stars and wrote \"These new versions of Dixon's biggest hits provide a fresh face to his music and are a real treat for his fans.\" Jonathan Andre from 365 Days of Inspiring Media gave the album four stars and stated \"Colton's songwriting skills way beyond his years, and the ability to transform songs into stripped down acoustic renditions are reasons alone to check out both Calm EP and Storm EP.\" Lauren McLean from The Christian Beat gave the album 4.1 stars and recognized that \"The Calm Before The Storm truly has something for everyone. Justin Sarachik from BreathCast stated \"The Calm Before the Storm is a great addition to the collection of fans of Colton Dixon's. While lyrically or on the message side, the listener won't get anything new except \"Where I End,\" musically it is entirely new and offers a fresh perspective. Sometimes artists rework songs and overdo it or make good songs bad. Dixon, did not do this in that case, and in some cases improved the songs. He also does a really good job at driving home the points of \"Calm\" and \"Storm\" with each half of the EPs.\"", "split": {"s": 1024, "o": 128}}
{"id": "ex2849", "tokens": "In 1814, Sondes presented his tutor, William Brice Fletcher, to the rectory of Kettering, of which he held the advowson. Fletcher entered into a bond with Sondes that he should resign the rectory when either of Sondes' younger brothers became capable of accepting a benefice. Sondes requested Fletcher's resignation in 1820 for the purpose of presenting his younger brother Henry; Fletcher, who had expected Sondes to find another benefice for him, refused, and Sondes successfully sued him for non-compliance. Fletcher appealed the verdict up to the House of Lords; in 1827, on judicial advice, they reversed the verdict and declared the bond to be simoniacal. Bonds of general resignation, where the appointee to a benefice bonded himself to resign whenever called upon by a patron to do so, had been held to be simoniacal in the case of Bishop of London v. Ffytche. However, bonds of special resignation, like that signed by Fletcher, were thought to have been legal and were frequently used until Fletcher v. Lord Sondes was decided. Parliament subsequently passed legislation indemnifying existing bondholders and legalizing bonds of special resignation under certain regulated terms. As the presentation of Fletcher had been adjudged simoniacal, it was held to be void and the right to make the next presentation fell to the Crown; the King presented Henry Watson to the rectory.", "split": {"s": 1024, "o": 128}}
{"id": "ex19350", "tokens": "When the prequel trilogy revived the film franchise in 1999, the action returned to Tatooine for Episode I: The Phantom Menace as the setting for the childhood of Luke's father, Anakin Skywalker. Living as a slave in another spaceport, Mos Espa, Anakin competes in pod races, long-distance airborne races across the desert. The Jedi master Qui-Gon Jinn meets Anakin after making an emergency landing on the planet, and helps him win his freedom. In Episode II: Attack of the Clones , an older Anakin returns to Tatooine to search for his mother, Shmi, who has been kidnapped by Tusken Raiders. The prequels depict a vast expanse of desert with jagged rock formations. Tatooine features once more in the final prequel film, Episode III: Revenge of the Sith ; in the closing scene, Obi-Wan Kenobi takes the infant Luke Skywalker and delivers him to his adoptive parents on the Tatooine moisture farm while he goes into hiding by residing in the Junland Wastelands which are in Tatooine's mountainous areas, thus explaining his first appearance in that location in Episode IV.", "split": {"s": 1024, "o": 128}}
{"id": "ex13826", "tokens": "Following the February Revolution of 1917, Askarov moved to Moscow, where the Moscow Federation of Anarchist Groups had occupied the Merchants' House and renamed it the \"House of Anarchy\". Although open to syndicalists and individualists, the Federation's membership consisted primarily of anarchist communists, with Askarov himself being brought on as editor of the organisation's newspaper Anarkhiia. After the October Revolution and the ratification of the Treaty of Brest-Litovsk, Russian anarchists quickly became dissilusioned with the government of Vladimir Lenin and the Moscow Federation began establishing armed units known as the Black Guards. When the Guards began carrying out unilateral expropriations, Anarkhiia repudiated such actions and declared the prohibition of unilateral action by Black Guardsmen. But this had already proved too much for the Bolshevik government, which launched a raid on the House of Anarchy, shutting down Anarkhiia and suppressing the Moscow Federation after a battle with the Black Guards.", "split": {"s": 1024, "o": 128}}
{"id": "ex1042", "tokens": "Iberia is host of impressive Paleolithic cave and rock art. Altamira cave is the most well-known example of the former, being a world heritage site since 1985. Côa Valley, in Portugal, and Siega Verde, in Spain, formed around tributaries into Douro, contain the best preserved rock art, forming together another world heritage site since 1998. Artistic manifestation is found most importantly in the northern Cantabrian area, where the earliest manifestations, for example the Caves of Monte Castillo are as old as Aurignacian times. The practice of this mural art increases in frequency in the Solutrean period, when the first animals are drawn, but it is not until the Magdalenian cultural phase when it becomes truly widespread, being found in almost every cave. Most of the representations are of animals (bison, horse, deer, bull, reindeer, goat, bear, mammoth, moose) and are painted in ochre and black colors but there are exceptions and human-like forms as well as abstract drawings also appear in some sites. In the Mediterranean and interior areas, the presence of mural art is not so abundant but exists as well since the Solutrean. The monumental Côa Valley has petroglyphs dating up to 22,000 years ago. These document continuous human occupation from the end of the Paleolithic Age. Other examples include Chimachias, Los Casares or La Pasiega, or, in general, the caves principally in Cantabria (in Spain).", "split": {"s": 1024, "o": 128}}
{"id": "ex977", "tokens": "While the first Alice novel took playing cards as a theme, Through the Looking-Glass instead used chess; most of the main characters are represented by chess pieces, with Alice being a pawn. The looking-glass world consists of square fields divided by brooks or streams, and the crossing of each brook typically signifies a change in scene, with Alice advancing one square. At the book's beginning, Carroll provided and explained a chess composition with descriptive notation, corresponding to the events of the story. Although the piece movements follow the rules of chess, other basic rules are ignored: one player (White) makes several consecutive moves while the (Red/Black) opponent's moves are skipped, and a late check (12... Qe8+) is left undealt with. Carroll also explained that certain items listed in the composition do not have corresponding piece moves but simply refer to the story, e.g. the \"castling of the three Queens, which is merely a way of saying that they entered the palace\". Despite these liberties, the final position is an authentic checkmate.", "split": {"s": 1024, "o": 128}}
{"id": "ex3071", "tokens": "Though the constitutional power of empresses was never defined, it was generally accepted that their coronation, performed after that of their husbands, granted them some imperial power. Often, their primary duties were to oversee the organization of ceremonies at the imperial court as well as to partake in imperial and religious affairs. Although governmental power was most often vested only in the emperor, empresses could gain significant authority as regents for young children or when their husbands were absent. Though they were bound by the wishes and temperaments of their husbands, empress consorts could at times also effectively become influential co-regents. In some cases, emperors reinforced their legitimacy through marrying the daughter of a previous emperor. In such cases, empresses sometimes stressed their dynastic legitimacy, greater than that of their husbands, to achieve great influence. Several influential consorts, such as Theodora, wife of Justinian I, and Euphrosyne, wife of Alexios III, held their own courts. Empresses who ruled in their own right, such as Irene and Zoë Porphyrogenita, sometimes adopted male titles such as basileus and autokrator to illustrate their power.", "split": {"s": 1024, "o": 128}}
{"id": "ex7165", "tokens": "Jane made the best of the start while Muir passed Raeburn for second place going into the second corner, but Raeburn was able to retake the position going up the back straight. Jane led by six seconds at the end of lap 1, while Beechey had made his way up to fifth place. He took second place halfway through lap 2 and began closing the gap to Jane, setting a new lap record of 1:20.8 in the process. He caught Jane on lap 7 and passed him at the first corner on lap 8. Brian Foley pitted on lap 11 with a broken brake line while Stan Starcevich retired on lap 14 with a broken differential. Jane retired on lap 23 when his engine overheated, which left Beechey leading by more than a lap over McKeown and Geoghegan. The two Cortina drivers swapped positions twice before the crankshaft on McKeown's car broke with six laps remaining, elevating Muir into third place. Muir then lost the position to Allan Moffat as he thought that Moffat was a lap down, but was able to retake the place before the end of the race.", "split": {"s": 1024, "o": 128}}
{"id": "ex7624", "tokens": "The Alsace-Moselle region was a specific exception, as it was annexed to Germany from 1871 to 1918 and therefore not part of France when the \"religious insult\" law was repealed. The German penal code replaced the pre-1871 French law between 1871 and 1918, and the local law in Alsace-Moselle retained some elements of both the German penal code and pre-1871 French law when the regions reverted to France in 1919, like the religious legislation and the articles 166 and 167. This long included a ban of \"blasphemy\" (as translated from the German word lästerung) against Christianity and Judaism, without mention of Islam which at the time had very few followers in Alsace. Since the dispositions of article 166 were not among those finally transposed officially in French law since the Act of 1 June 1924, whose article 1 and 1 s) introduced as well in Alsace-Moselle the generally referred to Act of 29 July 1881, then translated into French in 2013 by the decrees n•2013-395 and particularly n•2013-776, they received no application since then, as the appeal court of Colmar refused to apply this article in 1954, contrary to article 167 (obstacle to the exercise of worship). The minister of justice replied to some senators that article 166 was already implicitly repealed because contrary to the French fundamental law. Its validity could have also been questioned by a court since 1975 and by a prioritary question of constitutionality since 2008. In response to the Charlie Hebdo attack and with the full support of the Alsatian churches, an October 2016 vote of the French parliament symbolically repealed this long-dormant Alsace-Moselle blasphemy law which was long implicitly unenforceable.", "split": {"s": 1024, "o": 128}}
{"id": "ex16560", "tokens": "Early in the Cold War, in studies known as Project GABRIEL and Project SUNSHINE, researchers in the United States, the United Kingdom, and Australia tried to determine how much nuclear fallout would be required to make the Earth uninhabitable. They realized that atmospheric nuclear testing had provided them an opportunity to investigate this. Such tests had dispersed radioactive contamination worldwide, and examination of human bodies could reveal how readily it was taken up and hence how much damage it caused. Of particular interest was strontium-90 in the bones. Infants were the primary focus, as they would have had a full opportunity to absorb the new contaminants. As a result of this conclusion, researchers began a program to collect human bodies and bones from all over the world, with a particular focus on infants. The bones were cremated and the ashes analyzed for radioisotopes. This project was kept secret primarily because it would be a public relations disaster; as a result parents and family were not told what was being done with the body parts of their relatives. These studies should not be confused with the Baby Tooth Survey, which was undertaken during the same time period.", "split": {"s": 1024, "o": 128}}
{"id": "ex19727", "tokens": "When Bonnot's frustration with the capitalistic society grew to a breaking point, he decided that bank robberies were the most suitable expression of the sentiments of the Illegalists. They began by robbing a rare luxury car, a Delaunay-Belleville, to serve as the getaway vehicle for their crimes. This theft, in particular, was a triumph for Bonnot because it proved to him that the bourgeois were vulnerable to their exploits. The gang then built up an arsenal of weapons and a collection of hiding spots from the police. In late December 1911, the gang robbed and shot a bank messenger, stealing five thousand francs and bonds worth upwards of one hundred thousand francs. With this crime, several newspapers put up notices of a reward for the capture of the members of \"The Bonnot Gang\", and they were notorious among the general public of Paris as car bandits, an unprecedented new form of crime as motor vehicles had not been fully integrated into society at that point. This crime became known as one of the first robberies utilizing a motor vehicle to leave the crime scene. In light of their attacks against the capitalist society, the gang was able to garner support from some of the general public that sympathized with their hatred of the bourgeois. Jules Bonnot never considered himself as the leader of the gang because each member played a crucial role in each crime. However, because of his past notoriety and skills with motor vehicles, Jules was stamped as the face of the group.", "split": {"s": 1024, "o": 128}}
{"id": "ex870", "tokens": "Viewing under a petrographic microscope, the crystals contains a scattering of minute bubble-like inclusions. Paulingite is mostly isotropic and in extreme cases that faint, isolated, fuzzy and weak birefringent twinning which is a determining factor for differentiating paulingite from analcite (NaAlSi2O6·H2O). The refractive index at 230 in sodium vapor light by immersion method is 1.473. Single crystal diffraction study provides information that paulingite is cubic and the cubic length of a0 = 35.10 Å. It was determined from rotation photograph using copper Ka radiation, nickel filtered, with the film in self-calibrating arrangement. The reflections were indexed with the help of a zero-layer Weissenberg photograph. Reflections of the type hkl for l = 0 to l = 12 have been examined with equi-inclination weissenberg photographs, and only reflections having h+k+l even are observed, indicating a body-centered lattice. The crystal system is isometric. The space group of the paulingite is Im3m and the point group is 4/m3 2/m .", "split": {"s": 1024, "o": 128}}
{"id": "ex18391", "tokens": "At a party conference in October 1972, at which the Communist Party of the Netherlands (Marxist-Leninist) (KPN/ML), founded in 1971, changed its name to the Socialist Party, Poppe, known and popular in radical left circles, was presented as a new member of the party and was directly elected to the party board. He fulfilled a prominent role in the Milieu Aktiecentrum Nederland (MAN; 'Environmental Action Center of the Netherlands'), a collaboration between the CAR and the Bond van Huurders en Woningzoekenden (BHW; 'Association of Renters and Housing Seekers'), which was founded in January 1973 and, like the BHW, a front organization of the SP. The MAN exposed environmental scandals near Billiton in Arnhem, near Diosynth in Oss, near Verdugt in Tiel, and at the waste management company Exploitatie Maatschappij Krimpen (EMK; 'Exploitation Company of Krimpen') in Krimpen aan den IJssel. On behalf of the SP, Poppe was the lead candidate in the municipal elections in his hometown of Vlaardingen in 1974 and also in the 1977 Dutch general election, both without winning any seats. In 1978, the SP obtained one seat in Vlaardingen on a joint ticket with the Pacifist Socialist Party (PSP), which Poppe was allowed to occupy from 1980. Until 1994 he was a councilor and faction leader on behalf of his party on the municipal council of Vlaardingen. In 1994 the SP became the largest party in Vlaardingen with Poppe as the lead candidate, winning 19 percent of the vote and seven seats.", "split": {"s": 1024, "o": 128}}
{"id": "ex6516", "tokens": "The first member organization of UFS, the Uppsala Student Association for the League of Nations, was founded in 1925. Together with the other three original member associations at Gothenburg University, Lund University, and Stockholm University, it founded Sweden's Academic Association for the League of Nations, which in turn was part of the International University Federation of the League of Nations (IUFLN). However, in 1935, the Swedish branch left IUFLN and with its renaming into the Swedish Academic Association for Foreign Affairs (SAFU) in 1939, the break-off was completed. With the outbreak of World War II, both the local and the umbrella organizations were dissolved. After the war, they were founded anew, this time under an umbrella organization of the United Nations (UN). However, this organization was vacated in the mid-1980s. In 1997, a new umbrella organization was created by five associations under the name of Sweden's Foreign-Policy Associations and in 2007, it was renamed into the Swedish Association of International Affairs.", "split": {"s": 1024, "o": 128}}
{"id": "ex21296", "tokens": "In June 1812, Renard was part of the escort of a 33-ship convoy bound for Marseille. Soon after exiting Genoa, the convoy encountered a British squadron comprising the relatively new 74-gun HMS America, the 44-gun frigate Curacoa, and the 20-gun brig-sloop Swallow. The French forces amounted to Renard and the 6-gun schooner Goéland, under Lieutenant Saint-Belin. Recognising that Swallow, in the van of the British squadron, tended to sail at some distance from the America and Curacoa, Baudin sought an opportunity to isolate and capture her. He instructed Goéland to sail the convoy into the safety of Saint-Tropez. Then on 17 June, around noon, seizing a moment of favourable wind when Swallow was far in front of the main British forces, engaged her at close range. The brigs traded fire, with shots from Swallow quickly killing Ensign Charton and severely wounding Baudin, who nevertheless continued to direct the action. Meanwhile, Goéland attempted to assist Renard, but a cannonball took away her rudder and left her momentarily disabled. Soon afterwards, Swallow manoeuvered to rejoin her division, leaving the badly battered Renard, with 42 casualties, to reach Saint-Tropez.", "split": {"s": 1024, "o": 128}}
{"id": "ex17857", "tokens": "On January 6, 1856, two men gathering coontie south of the Miami River were killed. The settlers in the area promptly fled to Fort Dallas and Key Biscayne. A party of some twenty Seminoles under Ocsen Tustenuggee attacked a wood-cutting patrol outside of Fort Denaud, killing five of the six men. Despite the positioning of militia units to defend the area, the Seminoles also raided along the coast south of Tampa Bay. They killed one man and burned a house in what is now Sarasota, and on March 31, 1856, they tried to attack the \"Braden Castle\", the plantation home of Dr. Joseph Braden, in what is now Bradenton. The \"Castle\" was too strong for them, but they led away seven slaves and three mules. Burdened with prisoners and loot, the Seminoles did not move fast. While they were stopped at Big Charley Apopka Creek eating barbecued beef from a cow they had found and slaughtered, the militia caught up with them. The militiamen killed two of the Seminoles and recaptured the slaves and mules taken from Dr. Braden's plantation. The scalp of one of the dead Seminoles was displayed in Tampa, the other in Manatee.", "split": {"s": 1024, "o": 128}}
{"id": "ex13747", "tokens": "The Animal Wall was designed by Burges in 1866, but it was not built until 1890, after Burges' death in 1881. Burges had originally planned a Pre-Raphaelite garden to be constructed in the moat in front of the castle, and flowerbeds were laid out, those against the castle walls being planted with grape vines. The two lowest storeys of the Clock Tower were to provide accommodation for a gardener and gave access directly into the moat. Joseph Mordaunt Crook, the foremost authority on Burges, considers that the garden, had it been completed, \"might have been one of Burges's happiest devices unique: a municipal Pre-Raphaelite garden\". The wall on the street side of the garden was complete by 1885, but the carving of the animals was not undertaken until the late 1880s. Work on the castle and the building of the Animal Wall was undertaken by Burges' assistant William Frame. The original nine animal figures were sculptured by Thomas Nicholls, Burges' favourite sculptor, and included a hyena, a wolf, two baboons, a seal, a bear, a lioness, a lynx and two lions.", "split": {"s": 1024, "o": 128}}
{"id": "ex7224", "tokens": "Later, at the French outpost, the general is being acclaimed by his soldiers for his French courage - and General Birabeau, who is delighted with the accolades, says that the Red Shadow would be killed by a French firing squad. The general then gives the 50,000 francs reward money to Azuri, with the comment that the Red Shadow would be dead in the morning, and the horrified Azuri reveals, to General Birabeau, the true identity of the Red Shadow. Some soldiers then return from the desert, led by Captain Fontaine, and the general asks Paul where the Red Shadow is, saying he wants to see him. The captain replies that it is impossible because the Red Shadow is dead - with Paul commenting that he did not kill him. Then Pierre arrives, carrying the Red Shadow's clothes, and is given a hero's welcome by the French soldiers and their wives. General Birabeau is very happy to see Pierre, saying that he understood him now. Margot, who has fallen in love with the Red Shadow, is grief-stricken by the news of his death - and Pierre then reveals, to a surprised and delighted Margot, that he is the Red Shadow - and all ends happily.", "split": {"s": 1024, "o": 128}}
{"id": "ex14720", "tokens": "Narrabundah started the 2013 season with an indifferent 2–2 draw with UCU Pumas but soon found themselves on top of Pool B in the split league structure after winning their next four matches. By the end of the regular season Narrabundah finished top of Pool B with an undefeated record, nine wins; five draws; zero losses from fourteen matches. The Bulls met UCU Pumas in the quarter finals but this time defeated them 4–0 at Hackett Enclosed. Advancing to the semi-finals, Narrabundah took on Pool A third-place finishers, O'Connor Knights. The Bulls put in another convincing display and to earn a 4–0 victory at Kaleen Enclosed and advance to the grand final. 14 September 2013, Narrabundah FC met Queanbeyan City at Hawker Football Centre for the inaugural ACT Capital League grand final. The match was tightly contested between the two sides as the scores finished level at 0–0 at full time. Extra time was played and again no one could find an opening that sent the match into penalty kicks. Narrabundah won the penalty shoot-out 5–3 to clinch the trophy and claim the title. The first title in the club's history.", "split": {"s": 1024, "o": 128}}
{"id": "ex19310", "tokens": "In mid-January 2020, a monsoon trough began to produce persistent convection over the southwestern Indian Ocean near the Chagos Archipelago. An elongated wind circulation slowly developed within this aggregation of storms moving towards the southeast. MFR classified the system as a Zone of Disturbed Weather on 19 January and initiated advisories two days later. Due to strong wind shear and low-level convergence, conditions were unfavourable for substantial intensification. Strong convective bursts occurred in response to an attenuation of wind shear, leading the MFR to reclassify the system to a Tropical Disturbance on 22 January; nonetheless, the system remained generally disorganised as the center of circulation remained near the edge of the associated shower activity. The JTWC classified the asymmetric disturbance, now 1,315 km (817 mi) east of Mauritius, as a tropical storm later that day. On 23 January, the MFR upgraded the system to a tropical depression as convection continued to strengthen further in tandem with the diminishing of vertical wind shear; however, this period of strengthening was cut short by the storm's trajectory towards the subtropical jet stream. Coupled with a return of wind shear and cooling sea surface temperatures, shower activity associated with the storm quickly diminished; both the MFR and JTWC issued their final advisories on the storm on 23 January.", "split": {"s": 1024, "o": 128}}
{"id": "ex9116", "tokens": "After 78 days of the standoff, most of the protesters dismantled their barricades; the last occupied site was the Kanesatake treatment center, a tribal center for treating drug and alcohol addiction that had been built three years earlier. The women leaders in the center decided to end their protest. As some fifty adults and children marched out together, an altercation erupted between Mohawk warriors and soldiers. Horn-Miller, who was leading her four-year-old sister Kaniehtiio to safety, found herself face-to-face with a soldier who had, weeks earlier, refused to allow her to bring her schoolbooks into the encampment. \"I pointed at him and said 'I know you…' \" she recalled. \"As I pointed at him I pulled my little sister behind my back and right at that point I got hit in the chest... and I fell forward and then someone kicked my feet out from underneath me and I landed on my back and my little sister fell on top of me.\" Horn-Miller had been stabbed in the chest with a bayonet. She and the other protesters were held in custody for 22 hours more, before she was given full medical attention. She recalled that a doctor treating her told her that had the bayonet \"been a centimetre either way it would have gone right into your heart and you would have died.\"", "split": {"s": 1024, "o": 128}}
{"id": "ex213", "tokens": "The king's will alone was not enough to change the order of succession. Edward had to approve it by one of two possible procedures: either the law had to be approved by Parliament, or a royal letters patent had to be approved by the Privy Council, the high clergy, and the chief judges and then ratified by Parliament. Parliamentary hearings required time, which Edward no longer had and would have led to unwanted publicity, so the king and Dudley took the second route. On June 11, Edward summoned the high justices to his house for the initial approval of the next, third, revision of the Deuise. The judges were to edit the text, unanimously approve it, and submit the final, fourth revision to the king for approval. However, on June 12, at a meeting with the king, Chief Judge Edward Montagu strongly refused to approve the draft and accused Dudley of treason. Dudley responded with counter-accusations, and the dispute nearly ended in an armed clash. As a result, on June 15-16, the judges drew up a legal document unprecedented before—a will, a royal patent, and a public manifesto at the same time.", "split": {"s": 1024, "o": 128}}
{"id": "ex5232", "tokens": "In 2022, Dhawan starred alongside Kiara Advani in Jugjugg Jeeyo, a comedy-drama about divorce. Writing for Hindustan Times, Monika Rawal Kukreja commended him for \"add life to a complex character\". It earned ₹1.35 billion (US$16 million) worldwide to emerge as one of the highest-grossing films of the year. Dhawan played the title role in Bhediya, the third instalment in Dinesh Vijan's horror-comedy universe. The film was shot over a span of two months in various locations of Arunachal Pradesh. Sonal Dedhia of News18 wrote that he \"is in full form and is a delight to watch as an egoistic prick-turned-reluctant-werewolf\". Dhawan starred opposite Janhvi Kapoor in Nitesh Tiwari's Bawaal , a romantic drama about a feuding couple who learn about World War II as they travel across Europe. It was released digitally on Amazon Prime Video. The film received backlash for Holocaust trivialization. In a scathing review, Santanu Das of Hindustan Times criticised the lack of chemistry between the lead pair and dismissed Dhawan as \"particularly exasperating to witness\".", "split": {"s": 1024, "o": 128}}
{"id": "ex13849", "tokens": "After the dress rehearsal for Stefon's first appearance on Weekend Update, a line from the script had to be changed because it received no response. As the lines for Weekend Update are read from cue cards, Hader, who was unaware of the change during the show, broke character. Mulaney was amused by this and decided to continue to change the script before the live broadcast to make Hader laugh. To make sure Hader did not stumble on his lines, Mulaney would tell him the new jokes shortly before he entered the set. Mulaney characterized getting Hader to crack as a \"group effort\", adding that cast member Andy Samberg would stand near the camera, cross his hands, and look at Hader, tempting him to laugh. Hader also attributed his frequent corpsing as Stefon to the character's animated personality, which made him immerse himself in the role and lose his composure. Despite Stefon's popularity among fans, Hader felt pressure while portraying the role, as he often struggled to stay in character.", "split": {"s": 1024, "o": 128}}
{"id": "ex11150", "tokens": "Multiple media outlets considered Castle Wolfenstein to be significant in the shaping of the stealth games genre. Though no more Wolfenstein games were released by Muse Entertainment after Beyond Castle Wolfenstein, Metal Gear series and several other video games took elements and inspiration from the two original games. Casey Alkaisy, marketing manager at DICE, in his review of stealth games on Gamasutra, said the first foundations of the stealth genre were laid down in Pac-Man but its game mechanics only took shape with the advent of Castle Wolfenstein, after which other games using the same ideas began to appear. In its review of the series, Xbox Wire called Castle Wolfenstein a \"proto-stealth game\" that contains \"innovations that would go on to become standards in the stealth genre\". When speaking with Retro Gamer, Wolfenstein 3D co-creator John Romero credited Castle Wolfenstein as the \"original stealth shooter\". Castle Smurfenstein, a modified version of the game replacing assets and text with references to The Smurfs, is considered one of the first game mods.", "split": {"s": 1024, "o": 128}}
{"id": "ex9106", "tokens": "In the early 90s with the collapse of the Communist bloc and the People's Republic of Poland and the liberalization of trade and transformation to market economy, the city hall was searching a place to hold a retail market instead of the existing one in Bema Street which had become too small. The location that was decided was the former harvest square in Kawaleryjska street. Due to concerns from the retailers' side regarding the relative distance of the location from the city center, the authorities made a commitment that they would not establish another market in the city center. A major mark point was 1994, the year the trade in Belarus was liberalized, a step that contributed to the growth of trade and activity in the market. The years 1995 to 1998 saw high growth and thousands of cars from Lithuania and Belarus arrived to sell their stock. In 1998 there was a slump, even a collapse of the market since the Polish government limited cross-border trade by introducing visas, a decision that led to demonstrations. In 2020 the market is planned to pass through modernization program.", "split": {"s": 1024, "o": 128}}
{"id": "ex5095", "tokens": "Philip of the Croziermen was a 13th-century Norwegian Earl and Anti-king. Along with Erling Stonewall and Ingi of the Crozier-men he was a leader of the Croziermen. He seems to have spent most of his time in Tønsberg acting as the ruler of that city during his tenure as king of the Croziermen. Sometime around 1206 AD. he was chosen to be the new king of the Crozier-men following the death of Erling Stonewall.: 8–9 Around 1207 he led an army to Bergen where Prince Haakon IV of Norway was staying and were going to take the castle by force but it was given to them on the advice of the Archbishop Thorir.: 8–9 Many of the Crozier-men thought it would be a good idea to replace Philip with Haakon (a young boy) who they could control more.: 8–9 Philip was not aware of these plans.: 8–9 Soon Philip heard that Earl Haakon the Crazy was on his way to Bergen with an army and the crozier-men decided to flee from the city.: 8–9 Philip departed and left Prince Haakon (the boy) with the Archbishop Thorir per his request.: 10 Some time after this he married King Sverre of Norway's daughter Lady Christine.: 13", "split": {"s": 1024, "o": 128}}
{"id": "ex7056", "tokens": "Jones traveled and 'adventured' widely, occasionally with friend and fellow adventurer Roy Pinney (Jones's cameraman for a syndicated TV series called Wild Cargo), setting up camp for two years or so at a time in different places such as Rhodesia (now Zimbabwe) and Mexico City. His motto was \"younger women, faster airplanes, and bigger crocodiles.\" Jones's Lake Helen, Florida, Nautilus building was the home of Gomek, an 18-foot salt water crocodile that Jones was trying to grow to world record size. He was also an aficionado of venomous spiders and reptiles, a large collection of which was also housed in the Nautilus building. He ran a business that involved the importation of a variety of wild animals, ranging from tropical fish to snakes, parrots and monkeys. Jones's household included a jaguar named \"Gaylord\" that had free run of the house and even slept on the bed with his daughter. He once retrofitted several of his jumbo jets in order to transport 63 baby elephants, that had been orphaned in Africa, to his Jumbo Lair compound in Florida. Jones filmed the entire operation for television and entitled it Operation Elephant.", "split": {"s": 1024, "o": 128}}
{"id": "ex11030", "tokens": "The County class was designed around the GWS1 Seaslug beam riding anti-aircraft missile system. Seaslug was a first-generation surface-to-air missile intended to hit high-flying nuclear-armed bombers and surveillance aircraft like the Tupolev Tu-16 \"Badger\" and Tupolev Tu-95 \"Bear\", which could direct strikes against the British fleet from missile destroyers and cruise missile-armed submarines. The Tu 95 and the improved Tupolev Tu-142 were demanding targets for a missile like Seaslug; the long-range Soviet turboprop aircraft flew at an altitude of 7.5 mi (40,000 ft; 12,100 m), at 572 mph (921 km/h) and were barely within the engagement capability of Seaslug. In 1956 during the first integrated trials of Sea Slug on HMS Girdle Ness cancellation of Seaslug was considered. The RAF found Seaslug could not cover low and high level targets and was only marginally capable on subsonic targets at 3–10 miles and height of 1–7 miles, and not effective against modern V Bomber, English Electric Canberra and Soviet Il-28 type aircraft which were likely to be used in a 1956 Suez confrontation. The missile was obsolete in many Admirals and MPs views compared the USN Terrier missilem the RAF Bristol Bloodhound and the British Army's Thunderbird semi-active homing missiles in service by 1958. CNS, Mountbatten and Vice Admiral Reid, saw it as 'deplorable' that Sea Slug was so far behind due to the lack of engineers and higher priority for Korea but it was essential to Royal Navy and UK credibility and independence to continue with Sea Slug. A new British missile or adoption of the Terrier Mk11 or Thunderbird would take too long. The improved Mark 2 version of Seaslug had 10,000 ft greater altitude and speed.", "split": {"s": 1024, "o": 128}}
{"id": "ex3350", "tokens": "In October, Maribor played three league games, against Ankaran Hrvatini at home and against Rudar Velenje and Domžale away, narrowly winning all three games, scoring four goals and conceding one. Three out of four team goals were scored by Mešanović. In the first week of November, Maribor secured their highest win of the season after defeating Krško 5–0, with a hat-trick scored by team captain Marcos Tavares and a brace by Aleksander Rajčević. In the second \"Eternal derby\" of the season on 17 November 2017, Maribor defeated Olimpija 1–0 at home in front of 9,000 spectators with another goal scored by Tavares, topping the league table for the first time since early August. However, in the next round, Maribor suffered their first defeat of the season, losing 2–1 in the \"Styrian derby\" against Celje. In this match, Tavares scored his 130th goal in the Slovenian top division, tying himself with Štefan Škaper as the all-time top goalscorer in the PrvaLiga. Tavares became the sole record holder when he scored a winning goal in the next round against Gorica in a 2–1 victory. In the last round of the autumn part of the season, Maribor should have played against Aluminij, but the match was postponed to February 2018 due to snowy conditions. Before the winter break, Maribor were top of the league with 43 points out of 18 games.", "split": {"s": 1024, "o": 128}}
{"id": "ex3040", "tokens": "A scene in the episode \"Crisis\", where Adam Knight returns and subsequently shoots Lana in an alley, resulted in Entity FX doing more special effects work on a single scene than is typically performed. To make sure the computer-generated effects matched the set the actors were filming on, Mat Beck left his office in Los Angeles and travelled to the Smallville set to work alongside John Wash and John Hahn in constructing the scene. Producer Ken Horton wanted to be able to see the bullet travelling through each of the raindrops as it made its way toward Lana. To accomplish this, the team made the digital bullet larger than normal for better visibility. While filming, a flash zoom was created that would track around Kreuk as she was running, achieving the effect of watching the bullet get fired from the gun, fly through the raindrops, and then as the camera rotates around you see the bullet just as it about to hit Lana before Clark runs in and stops it. This moment in the scene is done in a freeze-frame shot, and the moment Clark stops the bullet everything returns to real time.", "split": {"s": 1024, "o": 128}}
{"id": "ex12450", "tokens": "While at the Denver Center for the Performing Arts, Hicks was asked by artistic director Donovan Marley if he wanted to direct the full cycle of August Wilson's plays and responded immediately \"Hell, yeah\". He was described by The New York Times as being the first person known to direct the 10 plays Wilson wrote in The Pittsburgh Cycle, starting with Fences in 1990, Joe Turner's Come and Gone in 1991, The Piano Lesson in 1993, Ma Rainey's Black Bottom in 1994, Two Trains Running in 1996, Seven Guitars in 1997, Jitney in 2002, King Hedley II in 2003, Gem of the Ocean in 2006 and Radio Golf in 2009. Hicks credited his time spent in the South as giving him a connection to Wilson's plays, saying his characters were \"like members of my family, my uncles and aunts\" and that to him \"August's plays are familiar clothing\". Wilson's play cycle documents African American life in the 20th century in Pittsburgh's Hill District and Hicks often wore a Pittsburgh Pirates baseball cap as his trademark while directing. In his two decades with the Denver Center Theatre Company, Hicks directed nearly 20 plays, and was scheduled to direct Ruined in 2011 for the company. Kent Thompson called Hicks' commitment to directing the entire play cycle \"extremely rare in the American theatre today\".", "split": {"s": 1024, "o": 128}}
{"id": "ex3170", "tokens": "Bumke studied at the universities in Freiburg, Leipzig, Munich and Halle. On 1 August 1901 he became an assistant physician at the psychiatric clinic and mental hospital in Freiburg, working under the noted psychiatrist Alfred Hoche, one of the most vocal critics of the \"natural disease entities\" classification of Emil Kraepelin. As is the custom in German universities, in order to be eligible for a professorship Bumke researched and wrote a second thesis or Habilitation. Published in 1904, Bumke's extensive literature review of the evidence for eye-pupil abnormalities in neurological and psychiatric conditions was an attempt to identify potential biomarkers that might be of diagnostic and research significance. Research on eye-movement abnormalities and the abnormal behavior of the pupils was widely researched at that time on both sides of the Atlantic Ocean as strong candidates for pathognomonic findings that could be discerned through a routine neurological examination that could confirm a diagnosis of Dementia praecox.", "split": {"s": 1024, "o": 128}}
{"id": "ex11764", "tokens": "Taktarov was billed in the event as \"The Russian Bear,\" a stereotypical nickname invented by his manager, and hailed as a Sambo representative, as this was the most exotic martial art in Taktarov's background. However, he stood out for his friendly demeanor, showing an infectious smile to the camera while introducing himself instead of the intimidating faces and postures other fighters were striking. His first fight was against Kempo Karate expert Ernie Verdicia, whom Oleg quickly submitted by pulling guard, sweeping him between his strikes, and locking an arm triangle choke for the tapout. He advanced round to meet Greco-Roman wrestler Dan Severn, but Taktarov's injured knee limited his performance, already disadvantaged by 55 lbs. Severn took the Russian down, passed his guard and blocked him against the cage wall, where Taktarov was repeatedly hit with knee strikes and headbutts while he tried to look for submissions. As the strikes opened a deep cut on Oleg's face, the referee stopped the fight in Severn's favor.", "split": {"s": 1024, "o": 128}}
{"id": "ex11271", "tokens": "Until recently, microscopy methods used in the characterization of these OPVs consisted of atomic force microscopy (AFM), transmission electron microscopy (TEM) and scanning transmission X-ray microscopy (STXM). These methods are very useful in the identification of the local morphology on the film surface, but lack the ability to provide fundamental information regarding local photocurrent generation and ultimately on the device performance. To obtain information which links the electrical and optical properties, the use of electrical scanning probe microscopy (SPM) is an active area of research. Electrostatic force microscopy (EFM) and scanning Kelvin probe microscopy (SKPM) have been utilized in the studies of electron injection and charge trapping effects, while scanning tunneling microscopy (STM) and conductive atomic force microscopy (c-AFM) have been used to investigate electron transport properties within these organic semiconductors. Conductive AFM has been widely used in characterizing the local electric properties in both photovoltaic fullerene blends and organic films, but no reports have shown the use of c-AFM to display the distribution of photocurrents in organic thin films. The most recent variation of SPM devices include (tr-EFM) and photoconductive AFM (pc-AFM) . Both these techniques are capable of obtaining information regarding photo-induced charging rates with nano-scale resolution. The advantage of pc-AFM over tr-ERM is present in the maximum obtainable resolution by each method. pc-AFM can map photocurrent distributions with approximately 20 nm resolution, whereas tr-EFM was only able to obtain between 50 and 100 nm resolution at this time. Another important factor to note is although the tr-EFM is capable of characterizing thin films within organic solar cells, it is unable to provide the needed information regarding the capacitance gradient nor the surface potential of the thin film.", "split": {"s": 1024, "o": 128}}
{"id": "ex19783", "tokens": "The 1880 Democratic platform was kept vague to hold the party together and avoid alienating any voters. During the campaign, Hancock and the Democrats attacked James A. Garfield, the Republican nominee, for his involvement in the Credit Mobilier scandal and his alleged support of unlimited Chinese immigration as evidenced by the forged Morey letter, which Garfield publicly denied having written. Meanwhile, Republicans attacked the Democrats by associating them with the Confederacy and calling attention to their alleged support for low protective tariffs in contrast to Republican support for higher tariffs. Republicans made much of Hancock's statement that \"the tariff question is a local question\". The former general had meant merely that it was for the voters to decide through their elected representatives in Congress, but it was used to suggest he did not understand the issue. Republicans avoided direct attacks on Hancock's character, instead focusing on his lack of political experience. They also circulated partisan rumors about how he had allegedly plotted to overthrow President Lincoln during the Civil War and had engaged in corrupt business practices while serving in Louisiana during Reconstruction.", "split": {"s": 1024, "o": 128}}
{"id": "ex8668", "tokens": "Joseph Addison also wrote a play, entitled Cato, in 1713, which concerned the Roman statesman Cato the Younger. The year of its première was important, with Queen Anne in serious illness at the time, and both the Tory ministry of the day and the Whig opposition (already being led by Robert Walpole) were concerned about the succession. Both groups were contacting the Old Pretender about bringing the Young Pretender over. Londoners sensed the anxiety, as Anne had no heirs, and all of the natural successors in the Stuart family were Roman Catholic or unavailable. Therefore, the figure of Cato was a transparent symbol of Roman integrity, and the Whigs saw in him a champion of Whig values, and the Tories saw in him an embodiment of Tory sentiments or, like the Tory Examiner, tried to claim that Cato was above political \"faction\". Both sides cheered the play, but Addison was himself clearly a Whig (Bloom and Bloom 266, 269). John Home's play Douglas would have a similar fate to Cato in the next generation, after the Licensing Act.", "split": {"s": 1024, "o": 128}}
{"id": "ex1424", "tokens": "Tajiri's knowledge of video games brought him into contact with Tsunekazu Ishihara. Ishihara had studied Arts and Science at Tsukuba University, and was trained in CGI. After working in advertising for two years, Ishihara joined a company named Sedic in 1983, which created video graphics and software, including one video game, Otocky . As video games grew in popularity, Sedic also produced a number of game-related television shows for Fuji Television's late-night slot. In his job as a TV producer, Ishihara befriended Tajiri, as well as Shigesato Itoi, who would later become CEO of Ape, Inc. Ishihara was also the general director of the world's first gaming encyclopedia: TV Games: Encyclopedia of Video Games (テレビゲーム―電視遊戯大全, Terebigēmu ― Denshi Yūgi Taizen). Hatakeyama & Kubo wrote that, at the time, Ishihara was probably the most well-connected man in the industry, with a knowledge of games \"beyond comparison\". Ishihara was also interested in playing cards, and contributed to the development of at least three simple card games designed by Itoi and published by Ape.", "split": {"s": 1024, "o": 128}}
{"id": "ex15055", "tokens": "In western New Mexico Territory, heavy rains fell in late January, causing severe flooding of the Colorado River and Gila River. On January 20, 1862, the Colorado River began to rise, and on the afternoon of January 22 it rose suddenly in three hours from an already high stage nearly 6 feet (1.8 m), overflowing its banks and turned Fort Yuma in California into an island in the midst of the Colorado River. At 1 o'clock on the morning of January 23, the river reached its crest. Jaeger City a mile down river from Fort Yuma, and Colorado City, across the Colorado River from it were washed away. The river overflowed its banks to the extent that there was water 20 feet (6.1 m) deep on a ranch in the low-lying ground just above Arizona City where the Gila River joined the Colorado. The riverside home of steamboat entrepreneur George Alonzo Johnson and the nearby Hooper residence were the only places in the town unharmed because they were built on high ground. Colorado City had to be rebuilt on higher ground after the 1862 flood.", "split": {"s": 1024, "o": 128}}
{"id": "ex17572", "tokens": "The first two Atlas F flights were Missile 2F on August 8, 1961 and Missile 4F on November 22, both from LC-11 at CCAS. Both tests were entirely successful, and on December 12, Missile 5F launched from LC-11. This test was a partial failure; an electrical short in the guidance system caused an early SECO command to be sent and the missile fell short of its planned range. On the 21st, Atlas 6F lifted off of LC-11 carrying a rhesus monkey named Scatback. This was the third launch of a primate on an Atlas in the past month - the first was Mercury-Atlas 5 which successfully lofted a chimpanzee on a two-orbit mission while the second, an Atlas E test, malfunctioned shortly after liftoff and had to be destroyed, claiming the life of the squirrel monkey it was carrying. Atlas 6F performed acceptably until after booster jettison when a hydraulic failure caused loss of sustainer thrust. The capsule separated and splashed down near Ascension Island in the South Atlantic, however the tracking beacon failed to operate and recovery crews could not locate it. They gave up the search and Scatback was officially lost at sea. The failure was traced to combustion of spent propellant following booster jettison which was damaging valves and/or ducting; it was solved by the installation of cutoff valves in the booster section.", "split": {"s": 1024, "o": 128}}
{"id": "ex4091", "tokens": "Basement layers are composed of Early Ordovician aged dolostone as a first sequence only to be stripped away by erosion in the Middle Ordovician. Sea transgression during continent reformation in the Middle Ordovician brought in a second sequence of deposition as clastic and carbonate sediments above this new unconformity. A third depositional sequence is found in the Late Ordovician, separated from the Middle Ordovician by local erosion and clastic sediments, consists of a shale base topped with more shale interbedded with limestone and calcareous siltstones. Above this is yet another unconformity, this time due to sea regression in the Late Ordovician to Early Silurian time. Large gaps in deposition from the Early Silurian through Mesozoic time allowed large scale erosion to occur in this geographic region, to the onset of Quaternary glaciation and subsequent sediment deposition. A 1997 report from the Geological Survey of Canada estimates the bedrock thickness to range between 50 and 500 metres (160 and 1,640 ft) thick, below approximately 200 metres (660 ft) of Pleistocene aged sediments. This broad range of thickness is representative of the unequal effects of regional erosion, uplift, sedimentary deposition and continental processes (tectonics, building and destroying of continents).", "split": {"s": 1024, "o": 128}}
{"id": "ex12404", "tokens": "During 1950, the Kremlin agreed to supply China and North Korea with MiG-15s, as well as train their pilots. The 50th Fighter Aviation Division (50 IAD), equipped with the MiG-15, was already based near Shanghai, as it had taken part in the Chinese Civil War (see previous section). A detachment from the 50 IAD was moved to Antung, next to the border with North Korea in August 1950. They formed the 29th Guards Fighter Regiment (29 GvIAP). When China entered the war in support of North Korea, the Soviets agreed to provide 16 operational air regiments of MiG-15s, including combat pilots. In the meantime, more MiG-15 pilots were recruited; the squadrons earmarked for Korea were drawn from elite units. The pilots had to be younger than 27, and priority was given to World War II veterans. The first large Soviet aviation unit sent to Korea, the 324th IAD, was an air defense interceptor division commanded by Colonel Ivan Kozhedub, who, with 62 victories, was the top Allied (and Soviet) ace of World War II. In November 1950, the 151st and 28th IADs plus the veteran 50th IAD were reorganized into the 64th Fighter Aviation Corps (64 IAK).", "split": {"s": 1024, "o": 128}}
